# OffsetHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageBackgroundSettings..::..OffsetHeight Property
ImageBackgroundSettings Class See Also
---
The vertical offset of the rendering image to the rendering region.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double OffsetHeight { get; set; }
```

Visual Basic
---
```text
Public Property OffsetHeight As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double OffsetHeight {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for height must be no more than 30000 feet in absolute value. |

# See Also
ImageBackgroundSettings Class
Autodesk.Revit.DB Namespace